# Sales Data Analysis

## Imports
Import Pandas and Numpy

In [17]:
import pandas as pd
import numpy as np

## Read in dataset
Use the `read_csv` function in Pandas to load in the file

In [18]:
# Data provided by https://www.superdatascience.com/
df = pd.read_csv("./OfficeSupplies.csv")

## General analysis on dataset
Get initial analysis on the data:
- `shape` tells how many rows and columns are in the data frame
- `head` shows the first five rows (by default) of the data frame
- `dtypes` shows each column name and each type the values of the column has
- [`describe`](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.describe.html) gives a few statistical measures on each numeric column:
    - The count, which should match the number of rows from calling `shape`
    - The mean (or average)
    - The [standard deviation](https://en.wikipedia.org/wiki/Standard_deviation)
    - The minimum and maximum value
    - The first, second, and third percentiles (or [quartiles](https://en.wikipedia.org/wiki/Quartile))

In [19]:
df.shape

(43, 6)

In [20]:
df.dtypes

OrderDate      object
Region         object
Rep            object
Item           object
Units           int64
Unit Price    float64
dtype: object

In [21]:
df.describe()

           Units  Unit Price
count  43.000000   43.000000
mean   49.325581   20.308605
std    30.078248   47.345118
min     2.000000    1.290000
25%    27.500000    3.990000
50%    53.000000    4.990000
75%    74.500000   17.990000
max    96.000000  275.000000

In [22]:
df.head()

     OrderDate   Region      Rep     Item  Units  Unit Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99
1  12-Jul-2014     East     Nick   Binder     29        1.99
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49
3  29-Jul-2014     East    Susan   Binder     81       19.99
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95

## Any null values in the dataset?
Using Pandas to see if there are any [null values](https://pandas.pydata.org/pandas-docs/stable/missing_data.html) that are in the dataset. This is to see if we need to handle these values, either by removing the rows or fill in the missing data with another value.

In [9]:
df.isnull().values.any()

False

## Reps who sold the most units

In [24]:
df.groupby(["Rep"]).sum().sort_values("Units", ascending=False)

         Units  Unit Price
Rep
Richard    396       55.92
Alex       281       39.95
Bill       213       40.55
Matthew    193      173.93
Rachel     183       10.26
Morgan     173       26.47
Susan      170       55.97
Smith      156      141.29
James      142      299.97
Nick       125        6.98
Thomas      89       21.98

## Add a new column to our dataset

In [11]:
df["Total Price"] = df["Units"] * df["Unit Price"]
df.head()

     OrderDate   Region      Rep     Item  Units  Unit Price  Total Price
0   4-Jul-2014     East  Richard  Pen Set     62        4.99       309.38
1  12-Jul-2014     East     Nick   Binder     29        1.99        57.71
2  21-Jul-2014  Central   Morgan  Pen Set     55       12.49       686.95
3  29-Jul-2014     East    Susan   Binder     81       19.99      1619.19
4   7-Aug-2014  Central  Matthew  Pen Set     42       23.95      1005.90

## Additional analysis

### Who sold the most?

In [12]:
df.groupby("Rep").sum().sort_values("Total Price", ascending=False).head()

         Units  Unit Price  Total Price
Rep
Matthew    193      173.93      3109.44
Susan      170       55.97      3102.30
Alex       281       39.95      2812.19
Richard    396       55.92      2363.04
Bill       213       40.55      1749.87

### Who sold the most units?

In [13]:
df.groupby("Rep").sum().sort_values("Units", ascending=False).head()

         Units  Unit Price  Total Price
Rep
Richard    396       55.92      2363.04
Alex       281       39.95      2812.19
Bill       213       40.55      1749.87
Matthew    193      173.93      3109.44
Rachel     183       10.26       438.37

### What region sold the most?

In [14]:
df.groupby("Region").sum()

         Units  Unit Price  Total Price
Region
Central   1199      432.45     11139.07
East       691      118.87      6002.09
West       231      321.95      2486.72

### What item sold the most?

In [15]:
df.groupby("Item").sum()

         Units  Unit Price  Total Price
Item
Binder     722      172.86      9577.65
Desk        10      525.00      1700.00
Pen        278       55.95      2045.22
Pen Set    395       83.39      4169.87
Pencil     716       36.07      2135.14

### Who sold the most in each region?

In [16]:
group = df.groupby(["Region","Rep"]).sum()
total_price = group["Total Price"].groupby(level=0, group_keys=False)
total_price.nlargest(5)

Region   Rep
Central  Matthew    3109.44
         Alex       2812.19
         Bill       1749.87
         Smith      1641.43
         Morgan     1387.77
East     Susan      3102.30
         Richard    2363.04
         Nick        536.75
West     James      1283.61
         Thomas     1203.11
Name: Total Price, dtype: float64